import '../core/psychoeducation_template.dart';

const anticipatoryAnxietyPages = [
  PsychoCard(
    title: "🔮 Што е тоа?",
    content:
        "Антиципаторната анксиозност е страв од нешто што сè уште не се случило.",
  ),
  PsychoCard(
    title: "🧠 Зошто мозокот го прави ова?",
    content:
        "Мозокот се обидува однапред да те заштити од потенцијална опасност.",
  ),
  PsychoCard(
    title: "📅 Типични примери",
    content:
        "Испит, презентација, состанок, патување, разговор или медицински преглед.",
  ),
  PsychoCard(
    title: "❌ Што ја одржува?",
    content:
        "Постојано планирање, анализирање и замислување на најлоши сценарија.",
  ),
  PsychoCard(
    title: "⚠️ Важно",
    content:
        "Фактот дека можеш да замислиш катастрофа не значи дека таа ќе се случи.",
  ),
  PsychoCard(
    title: "🎯 ACT потсетник",
    content: "Можам да носам неизвесност со себе и сепак да продолжам напред.",
  ),
  PsychoCard(
    title: "💪 Запомни",
    content:
        "Повеќето работи од кои се плашиме никогаш не се случуваат онака како што ги замислуваме.",
  ),
];
