class PmrCard {
  final String title;
  final String content;

  const PmrCard({required this.title, required this.content});
}

const pmrPages = [
  PmrCard(
    title: '🧘 Што е прогресивна мускулна релаксација?',
    content:
        'Прогресивната мускулна релаксација е техника во која намерно ги затегнуваме, а потоа ги опуштаме различните мускулни групи.',
  ),

  PmrCard(
    title: '🧠 Зошто се користи?',
    content:
        'Анксиозноста и стресот можат да создадат телесна напнатост. Со постепено опуштање на мускулите можеме да ја намалиме таа напнатост и да станеме посвесни за разликата помеѓу затегнато и опуштено тело.',
  ),

  PmrCard(
    title: '📍 Од каде се почнува?',
    content:
        'Обично се започнува од долниот дел на телото и постепено се продолжува нагоре: стапала, листови, бутови, стомак, раце, рамена, врат и лице.',
  ),

  PmrCard(
    title: '💪 Како се прави?',
    content:
        'Една мускулна група нежно се затегнува за кратко време, а потоа се опушта. Потоа се продолжува со следната мускулна група.',
  ),

  PmrCard(
    title: '😌 Што да забележиш?',
    content:
        'Обиди се да ја забележиш разликата помеѓу напнатоста пред опуштањето и чувството по опуштањето.',
  ),

  PmrCard(
    title: '⚠️ Важно',
    content:
        'Мускулите се затегнуваат нежно, без болка и без прекумерен напор. Ако некоја област е болна или повредена, прескокни ја.',
  ),

  PmrCard(
    title: '🎯 Што да очекувам?',
    content:
        'Можеш постепено да почувствуваш помала телесна напнатост, тежина или поголема свесност за телото. Не е потребно техниката веднаш да ја отстрани анксиозноста.',
  ),
];
